# MEPSpaceConstruction Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSpaceConstruction Class
Members See Also
---
Construction definition for Space.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class MEPSpaceConstruction
```

Visual Basic
---
```text
Public Class MEPSpaceConstruction
```

Visual C++
---
```text
public ref class MEPSpaceConstruction
```

# Remarks
This is used to define the information in Constructions.xml.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Mechanical..::..MEPSpaceConstruction
# See Also
MEPSpaceConstruction Members
Autodesk.Revit.DB.Mechanical Namespace